#define _CRT_SECURE_NO_WARNINGS
#include <iostream>
using namespace std;

int main() {

    char name1[9] = "RT-11-24", name2[9] = "RT-11-24", name3[9] = "CGU-12K";
    char sc1 = 'R', sc2 = 'R', sc3 = 'C';
    float sq3 = 17.5;
    int cnt1 = 12, cnt2 = 10, cnt3 = 3, sq1 = 100000, sq2 = 50000;
    //printf("1. Введите: обозначение, тип, номинал, количество >");
    //scanf("%s %c %f %d", name1, &sc1, &sq1, &cnt1);
    //printf("2. Введите: обозначение, тип, номинал, количество >");
    //scanf("%s %c %f %d", name2, &sc2, &sq2, &cnt2);
    //printf("3. Введите: обозначение, тип, номинал, количество >");
    //scanf("%s %c %f %d", name3, &sc3, &sq3, &cnt3);
    printf("---------------------------------------------\n");
    printf("|Ведомость комплектующих                    |\n");
    printf("|-------------------------------------------|\n");
    printf("| Обозначение | Тип | Номинал  | Количество |\n");
    printf("|-------------|-----|----------|------------|\n");
    printf("| %-11s | %-3c | %-8d | %-10d |\n", name1, sc1, sq1, cnt1);
    printf("| %-11s | %-3c | %-8d | %-10d |\n", name2, sc2, sq2, cnt2);
    printf("| %-11s | %-3c | %-8.1f | %-10d |\n", name3, sc3, sq3, cnt3);
    printf("|-------------------------------------------|\n");
    printf("| Примечание: R - резистор; C - конденсатор |\n");
    printf("---------------------------------------------\n");
    return 0;
}
